Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ИспользованиеДополнительныхМатериаловСУЗ/ИспользованиеДополнительныхМатериаловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованиеДополнительныхМатериаловСУЗ</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДополнительныеМатериалыПользователейСУЗ/ДополнительныеМатериалыПользователейСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеМатериалыПользователейСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Общий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ИзбранноеПользователейСУЗ/ИзбранноеПользователейСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранноеПользователейСУЗ</name>
  <attributes>
    <name>ДатаОтметки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СессииВебКабинетаСУ/СессииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СессииВебКабинетаСУ</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроцессаОбученияСУО/СтатусыПроцессаОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаОбученияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Окончено</name>
  </enumValues>
  <enumValues>
    <name>ОконченоБезПроверки</name>
  </enumValues>
  <enumValues>
    <name>ОконченоАвтоматом</name>
  </enumValues>
  <enumValues>
    <name>НеОкончено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/СессияЭлектронногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияЭлектронногоРесурсаСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяСессия</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСессии</name>
    <type>
      <types>EnumRef.ТипыСессийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекстовые</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТекстовые</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/WebServices/ЭлектронныеРесурсыСУЗ/Module.bsl
// ВЕБ-СЕРВИС

Функция getLink(search, base)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем свойства ссылки
	
	Если НЕ ЗначениеЗаполнено(search) Тогда
		Возврат "Error:" + НСтр("ru = 'Ссылка не задана'");
	КонецЕсли;
	
	РезультатПолученияАдреса = ЭлектронныеРесурсыСУЗ.АдресПубликацииЭлектронногоРесурса(search, base, "");  
	
	Если ЗначениеЗаполнено(РезультатПолученияАдреса.КодОшибки) Тогда
		Возврат "Error:" + РезультатПолученияАдреса.ОписаниеОшибки;
	Иначе
		Возврат "link:" + РезультатПолученияАдреса.Адрес;
	КонецЕсли;

КонецФункции

Функция getData(id, userActivity, task, providingEducation, checksum, session, key, user)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные запроса
	
	ЭлектронныйРесурс         = Неопределено;
	ПрохождениеОбучения       = Неопределено;
	Задание                   = Неопределено;
	Пользователь              = Неопределено;
	КонтрольнаяСумма          = 0;
	ЭтоПроверкаПреподавателем = Ложь;
	ТекстОшибки               = "";
	
	ОпределитьПеременныеКонтекста(id, userActivity, task, providingEducation, checksum, session, key, user, ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, КонтрольнаяСумма, Истина, ТекстОшибки, ЭтоПроверкаПреподавателем);

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Проверяем нет ли прохождений в личном кабинете
	
	КорневаяСессияПрохождения = Неопределено;
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		ЕстьПопыткиПрохожденияИзЛичногоКабинета = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЕстьПопыткиПрохожденияИзЛичногоКабинета(Пользователь, ПрохождениеОбучения, Задание);
		Если ЕстьПопыткиПрохожденияИзЛичногоКабинета Тогда
			КорневаяСессияПрохождения = Документы.СессияЭлектронногоРесурсаСУЗ.КорневаяСессияПрохожденияЭлектронногоКурса(Пользователь, ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
			ЕстьПопыткиПрохожденияИзВебКабинета = ЗначениеЗаполнено(КорневаяСессияПрохождения);
			Если НЕ ЕстьПопыткиПрохожденияИзВебКабинета Тогда
				Возврат "Error:" + НСтр("ru = 'Используйте личный кабинет в программе 1С для открытия электронного ресурса'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Получаем данные прохождения
	
	СвойстваЭлектронногоРесурса = ЭлектронныеРесурсыСУЗ.ПолучитьСвойства(ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь,, КорневаяСессияПрохождения);
	
	Если СвойстваЭлектронногоРесурса = Неопределено Тогда
		Возврат "Error:" + НСтр("ru = 'Невозможно получить данные прохождения'");
	КонецЕсли;
	
	Возврат СвойстваЭлектронногоРесурса.ДанныеПрохождения;
	
КонецФункции

Функция saveData(id, userActivity, task, providingEducation, checksum, userData, session, key, user)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭлектронныйРесурс         = Неопределено;
	ПрохождениеОбучения       = Неопределено;
	Задание                   = Неопределено;
	Пользователь              = Неопределено;
	КонтрольнаяСумма          = 0;
	ЭтоПроверкаПреподавателем = Ложь;
	ТекстОшибки               = "";	

	ОпределитьПеременныеКонтекста(id, userActivity, task, providingEducation, checksum, session, key, user, ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, КонтрольнаяСумма, Ложь, ТекстОшибки, ЭтоПроверкаПреподавателем);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;	
	
	Попытка
		РезультатСохранения = ЭлектронныеРесурсыСУЗ.СохранитьДанныеПрохождения(userData, ЭлектронныйРесурс, КонтрольнаяСумма, Пользователь, ПрохождениеОбучения, Задание, ЭтоПроверкаПреподавателем);
	Исключение
		РезультатСохранения = "Error:" + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат РезультатСохранения;
	
КонецФункции

Функция getUserData(id, userActivity, task, providingEducation, checksum, session, key, user)

	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные запроса
	
	ЭлектронныйРесурс         = Неопределено;
	ПрохождениеОбучения       = Неопределено;
	Задание                   = Неопределено;
	Пользователь              = Неопределено;
	КонтрольнаяСумма          = 0;
	ЭтоПроверкаПреподавателем = Ложь;
	ТекстОшибки               = "";
	
	ОпределитьПеременныеКонтекста(id, userActivity, task, providingEducation, checksum, session, key, user, ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, КонтрольнаяСумма, Истина, ТекстОшибки, ЭтоПроверкаПреподавателем);

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Получаем данные
	
	ДанныеДляВозврата = Новый Структура("personal, favorite", Новый Структура("allow, elements", ЛОЖЬ, NULL), Новый Структура("allow, elements", ИСТИНА, NULL));
	
	ДанныеДляВозврата.personal.allow = РегистрыСведений.ИспользованиеДополнительныхМатериаловСУЗ.МожноИспользоватьДополнительныеМатериалы(ЭлектронныйРесурс, Задание);
	
	Если ДанныеДляВозврата.personal.allow Тогда		
		
		ДанныеДляВозврата.personal.elements = РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.ТаблицаМатериалов(Пользователь,,ЭлектронныйРесурс);
		
		ДанныеДляВозврата.personal.elements.Колонки.Дата.Имя = "date";
		ДанныеДляВозврата.personal.elements.Колонки.Автор.Имя = "author";
		ДанныеДляВозврата.personal.elements.Колонки.НаименованиеАвтора.Имя = "authorName";
		ДанныеДляВозврата.personal.elements.Колонки.ЭлементСодержания.Имя = "itemId";
		ДанныеДляВозврата.personal.elements.Колонки.СсылкаНаОбъектСУЗ.Имя = "object";
		ДанныеДляВозврата.personal.elements.Колонки.Наименование.Имя = "name";		
		ДанныеДляВозврата.personal.elements.Колонки.Текст.Имя = "text";
		ДанныеДляВозврата.personal.elements.Колонки.ДатаИзменения.Имя = "editDate";
		ДанныеДляВозврата.personal.elements.Колонки.Картинка.Имя = "image";
		ДанныеДляВозврата.personal.elements.Колонки.Общий.Имя = "common";
		
		ДанныеДляВозврата.personal.elements.Колонки.Добавить("deleted");
		ДанныеДляВозврата.personal.elements.Колонки.Добавить("new");
		ДанныеДляВозврата.personal.elements.Колонки.Добавить("type");
		ДанныеДляВозврата.personal.elements.Колонки.Добавить("edited");
		ДанныеДляВозврата.personal.elements.Колонки.Добавить("item");
		ДанныеДляВозврата.personal.elements.Колонки.Добавить("readonly");
		
		Для каждого Строка Из ДанныеДляВозврата.personal.elements Цикл
		
			Строка.deleted = ЛОЖЬ;
			Строка.new = ЛОЖЬ;
			Строка.edited = ЛОЖЬ;
			
			Если ЗначениеЗаполнено(Строка.object) Тогда
				
				Если ТипЗнч(Строка.object) = Тип("СправочникСсылка.СтраницыСУЗ") Тогда
					Строка.type = "page";	
				КонецЕсли;
				
				Если ТипЗнч(Строка.object) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
					Строка.type = "file";	
				КонецЕсли;				
				
			Иначе
				
				Строка.type = "text";
				
			КонецЕсли;
			
			ИдентификаторЭлементаСодержания = Строка.itemId.УникальныйИдентификатор(); 
			
			Если ТипЗнч(Строка.itemId) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда				
				Строка.item = Новый Структура("id, type", ИдентификаторЭлементаСодержания, "item");
			Иначе
				Строка.item = Новый Структура("id, type", ИдентификаторЭлементаСодержания, "knowledgeBase");
			КонецЕсли;
			
			Строка.readonly = ?(Строка.author = Пользователь, Ложь, Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеДляВозврата.favorite.allow Тогда //Всегда		
		
		ДанныеДляВозврата.favorite.elements = РегистрыСведений.ИзбранноеПользователейСУЗ.ТаблицаИзбранного(Пользователь);
		
		ДанныеДляВозврата.favorite.elements.Колонки.ЭлементСодержания.Имя = "itemId";
		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ДанныеДляВозврата)
	
КонецФункции

Функция saveUserData(id, userActivity, task, providingEducation, checksum, userData, session, key, user)

	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные запроса
	
	ЭлектронныйРесурс         = Неопределено;
	ПрохождениеОбучения       = Неопределено;
	Задание                   = Неопределено;
	Пользователь              = Неопределено;
	КонтрольнаяСумма          = 0;
	ЭтоПроверкаПреподавателем = Ложь;
	ТекстОшибки               = "";
	
	ОпределитьПеременныеКонтекста(id, userActivity, task, providingEducation, checksum, session, key, user, ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, КонтрольнаяСумма, Истина, ТекстОшибки, ЭтоПроверкаПреподавателем);

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Записываем данные
	
	ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(userData);
	
	Если ДанныеДляЗаписи.Свойство("personal") Тогда
		
		Если НЕ ДанныеДляЗаписи.personal.Свойство("elements") ИЛИ ТипЗнч(ДанныеДляЗаписи.personal.elements) <> Тип("Массив") Тогда
			Возврат "Error:" + НСтр("ru = 'Невозможно получить элементы для сохранения материалов пользователя'");
		КонецЕсли;
		
		Для каждого Элемент Из ДанныеДляЗаписи.personal.elements Цикл
			
			Если НЕ Элемент.Свойство("text") Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаЭлемента = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Элемент.date);
			
			Если Элемент.item.type = "item" Тогда
				ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.item.id));
			Иначе
				ЭлементСодержания = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.item.id));
			КонецЕсли;
			
			АвторЭлемента = ?(ЗначениеЗаполнено(Элемент.author), Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.author)), Неопределено);
			
			Если Элемент.deleted Тогда				
				РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.УдалитьМатериал(ДатаЭлемента, ЭлементСодержания, Истина, Пользователь);
			Иначе
				РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.ЗаписатьМатериал(ДатаЭлемента, ЭлементСодержания, АвторЭлемента,,Пользователь, Элемент.text, Элемент.common, ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Элемент.editDate), Ложь);
			КонецЕсли;			
		
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеДляЗаписи.Свойство("favorite") Тогда
		
		Если ДанныеДляЗаписи.favorite.Свойство("item") Тогда
			
			ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДляЗаписи.favorite.item));
			
			РегистрыСведений.ИзбранноеПользователейСУЗ.ДобавитьУдалитьЭлементВИзбранном(ЭлементСодержания, Пользователь, Истина);
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ДанныеДляЗаписи); 
	
КонецФункции

// СЛУЖЕБНЫЕ

Процедура ОпределитьПеременныеКонтекста(id, userActivity, task, providingEducation, checksum, session, key, user,  ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, КонтрольнаяСумма, ПроверятьПрава, Ошибка, ЭтоПроверкаПреподавателем)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		КонтрольнаяСумма = Число(checksum);
	Исключение
		Ошибка = "Error:" + НСтр("ru = 'Неверный формат контрольной суммы'");
		Возврат;
	КонецПопытки;	
	
	Если НЕ ЗначениеЗаполнено(key) Тогда
		Ошибка = "Error:" + НСтр("ru = 'Ключ сессии не задан'");
		Возврат;
	КонецЕсли;
	
	// Получаем данные сессии

	ДанныеСессии = РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессии(session);
	
	Если ДанныеСессии = Неопределено Тогда
		Ошибка = "Error:" + НСтр("ru = 'Сессия не найдена'");
		Возврат;
	КонецЕсли;
	
	Если ДанныеСессии.Закрыта Тогда
		Ошибка = "Error:" + НСтр("ru = 'Сессия закрыта'");
		Возврат;
	КонецЕсли;	
	
	// Проверяем ключ на корректность
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(id + ДанныеСессии.СохраняемоеЗначениеПароля + ДанныеСессии.ИдентификаторКлиента + session);
	
	КлючСессии = Base64Строка(Хеширование.ХешСумма);
	
	Если КлючСессии <> key Тогда
		Ошибка = "Error:" + НСтр("ru = 'Неверный ключ сессии'");
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(user) Тогда
		
		Попытка
			Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(user));
		Исключение
			Ошибка = "Error:" + НСтр("ru = 'Неверный идентификатор пользователя'");
			Возврат;
		КонецПопытки;
		
		Если Пользователь = ДанныеСессии.Пользователь Тогда
			Ошибка = "Error:" + НСтр("ru = 'Нарушение прав доступа'");
			Возврат;			
		КонецЕсли;
		
		ЭтоПроверкаПреподавателем = Истина;
		
	Иначе
		
		Пользователь = ДанныеСессии.Пользователь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Ошибка = "Error:" + НСтр("ru = 'Пользователь не найден'");
		Возврат;
	КонецЕсли;
	
	Попытка
		ИдентификаторЭлектронногоРесурса = Новый УникальныйИдентификатор(id);
	Исключение
		Ошибка = "Error:" + НСтр("ru = 'Неверный идентификатор электронного ресурса'");
		Возврат;
	КонецПопытки;

	ЭлектронныйРесурс = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(ИдентификаторЭлектронногоРесурса);
	
	Если ПроверятьПрава Тогда
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
			Ошибка = "Error:" + НСтр("ru = 'Электронный ресурс не существует в базе'");
			Возврат;			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(userActivity) ИЛИ ЗначениеЗаполнено(providingEducation) Тогда
		
		// Электронный ресурс запущен в контексте обучения учащимся или преподавателем
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
		
		Если ЗначениеЗаполнено(userActivity) И ЗначениеЗаполнено(providingEducation) Тогда
			Ошибка = "Error:" + НСтр("ru = 'Противоречивый набор параметров'");
			Возврат;			
		КонецЕсли;
		
		Если ПроверятьПрава Тогда

			Права = ДанныеСессии.Права.Получить();
			
			ЕстьПравоУчащегося = ?(Права.Свойство("Обучение") И Права.Обучение, Истина, Ложь);
			ЕстьПравоПреподавателя = ?(Права.Свойство("Преподавание") И Права.Преподавание, Истина, Ложь);
			
			Если НЕ ЕстьПравоУчащегося И НЕ ЕстьПравоПреподавателя Тогда
				Ошибка = "Error:" + НСтр("ru = 'Нарушение прав доступа'");
				Возврат;
			КонецЕсли;
			
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(userActivity) Тогда
		
			Попытка
				ИдентификаторПрохожденияМероприятия = Новый УникальныйИдентификатор(userActivity);
			Исключение
				Ошибка = "Error:" + НСтр("ru = 'Неверный идентификатор прохождения мероприятия'");
				Возврат;
			КонецПопытки;		
			
			ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияМероприятия);		
			
			Если ЗначениеЗаполнено(task) Тогда
			
				Попытка
					ИдентификаторЗадания = Новый УникальныйИдентификатор(task);
				Исключение
					Ошибка = "Error:" + НСтр("ru = 'Неверный идентификатор задания'");
					Возврат;
				КонецПопытки;
				
				Задание = Справочники.ЗаданияСУО.ПолучитьСсылку(ИдентификаторЗадания);
				
				Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Задание, Ложь) Тогда
					Задание = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(ИдентификаторЗадания);
				КонецЕсли;
				
				Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Задание, Ложь) Тогда
					Ошибка = "Error:" + НСтр("ru = 'Неверный идентификатор задания'");
					Возврат;					
				КонецЕсли;
				
			Иначе
				
				Ошибка = "Error:" + НСтр("ru = 'Задание не задано'");
				Возврат;
				
			КонецЕсли;
			
			Если ПроверятьПрава Тогда
				
				ТребуемыеДанные = Новый Структура("
				|Пользователь,
				|ПроведениеОбучения,
				|Сценарий,
				|ВариантПродолжительности,
				|ДатаНачалаПрохождения",
				"Пользователь",
				"ПроведениеОбучения",
				"Сценарий",
				"ПроведениеОбучения.ВариантПродолжительности",
				"ДатаНачалаПрохождения"
				);

				ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);

				Если ДанныеПрохожденияОбучения.Пользователь <> Пользователь Тогда
					Ошибка = "Error:" + НСтр("ru = 'Нарушение прав доступа'");
					Возврат;					
				КонецЕсли;
				
				Если НЕ ЕстьПравоПреподавателя Тогда
					
					ЗаданияДоступны = Документы.ПрохождениеОбученияСУО.ЗаданияДоступны(ПрохождениеОбучения, ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий,,,ДанныеПрохожденияОбучения.ВариантПродолжительности,ДанныеПрохожденияОбучения.ДатаНачалаПрохождения);
					
					Если НЕ ЗаданияДоступны Тогда
						Ошибка = "Error:" + НСтр("ru = 'Доступ к электронному курсу закрыт'");
						Возврат;					
					КонецЕсли;
					
					ЭлектронныйРесурсУчаствуетВОбучении = Ложь;
					
					ОписаниеЕдинственногоЗадания = Документы.ПрохождениеОбученияСУО.ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения, ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
					
					Если ОписаниеЕдинственногоЗадания <> Неопределено Тогда
						Если ОписаниеЕдинственногоЗадания.ЭлектронныйРесурс = ЭлектронныйРесурс Тогда
							ЭлектронныйРесурсУчаствуетВОбучении = Истина;
						КонецЕсли;
					КонецЕсли;
					
					ЗаданияОбучения = Документы.ПроведениеОбученияСУО.ЗаданияОбучения(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
					
					Для каждого Строка Из ЗаданияОбучения Цикл
					
						Если Строка.ЭлектронныйРесурс = ЭлектронныйРесурс Тогда
							ЭлектронныйРесурсУчаствуетВОбучении = Истина;
						КонецЕсли;					
					
					КонецЦикла;
					
					Если НЕ ЭлектронныйРесурсУчаствуетВОбучении Тогда
						Ошибка = "Error:" + НСтр("ru = 'Электронный ресурс отсутствует в данном обучении'");
						Возврат;
					КонецЕсли;					
					
				КонецЕсли;					
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(providingEducation) Тогда
			
			Если ПроверятьПрава Тогда
				
				Попытка
					ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(providingEducation);
				Исключение
					Ошибка = "Error:" + НСтр("ru = 'Неверный идентификатор проведения обучения'");
					Возврат;
				КонецПопытки;		
				
				ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(ИдентификаторПроведенияОбучения);		
				
				// Проверяем для всех участников, и не активных тоже, так как им тоже могут быть доступны ЭР
				УчастникиОбучения = Документы.ПроведениеОбученияСУО.УчастникиОбучения(ПроведениеОбучения,,,,,,,,Пользователь); 
				ПреподавателиОбучения = Документы.ПроведениеОбученияСУО.Преподаватели(ПроведениеОбучения,,,Пользователь);
				
				ЭтоПреподаватель = Ложь;
				ЭтоУчащийся = Ложь;
				ПрохождениеОбученияУчастника = Неопределено;
				
				Если Пользователь = ДанныеСессии.Пользователь Тогда
					
					Для каждого Строка Из УчастникиОбучения Цикл
						Если Строка.Пользователь = Пользователь Тогда
							ЭтоУчащийся = Истина;
							ПрохождениеОбученияУчастника = Строка.Прохождение;
						КонецЕсли;
					КонецЦикла;
					
					Для каждого Строка Из ПреподавателиОбучения Цикл
						Если Строка.Пользователь = Пользователь Тогда
							ЭтоПреподаватель = Истина;
						КонецЕсли;
					КонецЦикла;					
					
				КонецЕсли;
				
				Если Пользователь <> ДанныеСессии.Пользователь Тогда
					
					Для каждого Строка Из ПреподавателиОбучения Цикл
						Если Строка.Пользователь = ДанныеСессии.Пользователь Тогда
							ЭтоПреподаватель = Истина;
						КонецЕсли;
					КонецЦикла;					
					
				КонецЕсли;				
				
				Если НЕ ЭтоПреподаватель И НЕ ЭтоУчащийся Тогда
					Ошибка = "Error:" + НСтр("ru = 'Пользователь не участвует в обучении'");
					Возврат;					
				КонецЕсли;
												
				ДанныеПроведенияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "СхемаПроведения, Статус, ЭлектронныйРесурс");
				СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
				
				ЭлектронныеРесурсыОбучения = Новый ТаблицаЗначений;
				ЭлектронныеРесурсыОбучения.Колонки.Добавить("ЭлектронныйРесурс");
				ЭлектронныеРесурсыОбучения.Колонки.Добавить("СкрыватьОтУченика");
				ЭлектронныеРесурсыОбучения.Колонки.Добавить("ПоказатьПослеПрохождения");
				ЭлектронныеРесурсыОбучения.Колонки.Добавить("ПоказатьПриСтатусеЗапланировано");
				ЭлектронныеРесурсыОбучения.Колонки.Добавить("ПоказатьПриСтатусеАктивно");
				ЭлектронныеРесурсыОбучения.Колонки.Добавить("ПоказатьПриСтатусеЗавершено");
				
				Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ЭлектронныйРесурс) Тогда
					
					НоваяСтрока = ЭлектронныеРесурсыОбучения.Добавить();
					НоваяСтрока.ЭлектронныйРесурс = ДанныеПроведенияОбучения.ЭлектронныйРесурс;
					НоваяСтрока.СкрыватьОтУченика = Ложь;
					НоваяСтрока.ПоказатьПослеПрохождения = Ложь;
					НоваяСтрока.ПоказатьПриСтатусеЗапланировано = Ложь;
					НоваяСтрока.ПоказатьПриСтатусеАктивно = Истина;
					НоваяСтрока.ПоказатьПриСтатусеЗавершено = Ложь;
					
				КонецЕсли;				
				
				ВыборкаЭлектронныхРесурсов = Документы.ПроведениеОбученияСУО.ПрикрепленныеЭлектронныеРесурсы(ПроведениеОбучения, СценарийОбучения);
				
				Пока ВыборкаЭлектронныхРесурсов.Следующий() цикл
					
					НоваяСтрока = ЭлектронныеРесурсыОбучения.Добавить();
					НоваяСтрока.ЭлектронныйРесурс = ВыборкаЭлектронныхРесурсов.ЭлектронныйРесурс;
					НоваяСтрока.СкрыватьОтУченика = ВыборкаЭлектронныхРесурсов.СкрыватьОтУченика;
					НоваяСтрока.ПоказатьПослеПрохождения = ВыборкаЭлектронныхРесурсов.ПоказатьПослеПрохождения;
					НоваяСтрока.ПоказатьПриСтатусеЗапланировано = ВыборкаЭлектронныхРесурсов.ПоказатьПриСтатусеЗапланировано;
					НоваяСтрока.ПоказатьПриСтатусеАктивно = ВыборкаЭлектронныхРесурсов.ПоказатьПриСтатусеАктивно;
					НоваяСтрока.ПоказатьПриСтатусеЗавершено = ВыборкаЭлектронныхРесурсов.ПоказатьПриСтатусеЗавершено;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.СхемаПроведения) Тогда
	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	КаталогМероприятийСУОЭлектронныеРесурсы.ЭлектронныйРесурс,
						|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПослеПрохождения,
						|	КаталогМероприятийСУОЭлектронныеРесурсы.СкрыватьОтУченика,
						|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗапланировано,
						|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеАктивно,
						|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗавершено
						|ИЗ
						|	Справочник.КаталогМероприятийСУО.ЭлектронныеРесурсы КАК КаталогМероприятийСУОЭлектронныеРесурсы
						|ГДЕ
						|	КаталогМероприятийСУОЭлектронныеРесурсы.Ссылка.Владелец = &СхемаПроведения";
					
					Запрос.УстановитьПараметр("СхемаПроведения", ДанныеПроведенияОбучения.СхемаПроведения);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						НоваяСтрока = ЭлектронныеРесурсыОбучения.Добавить();
						НоваяСтрока.ЭлектронныйРесурс = ВыборкаЭлектронныхРесурсов.ЭлектронныйРесурс;
						НоваяСтрока.СкрыватьОтУченика = ВыборкаЭлектронныхРесурсов.СкрыватьОтУченика;
						НоваяСтрока.ПоказатьПослеПрохождения = ВыборкаЭлектронныхРесурсов.ПоказатьПослеПрохождения;
						НоваяСтрока.ПоказатьПриСтатусеЗапланировано = ВыборкаЭлектронныхРесурсов.ПоказатьПриСтатусеЗапланировано;
						НоваяСтрока.ПоказатьПриСтатусеАктивно = ВыборкаЭлектронныхРесурсов.ПоказатьПриСтатусеАктивно;
						НоваяСтрока.ПоказатьПриСтатусеЗавершено = ВыборкаЭлектронныхРесурсов.ПоказатьПриСтатусеЗавершено;

					КонецЦикла;
					
				КонецЕсли;
				
				МожноПросматриватьЭлектронныйРесурс = Ложь;
				
				Для каждого Строка Из ЭлектронныеРесурсыОбучения Цикл
				
					Если Строка.ЭлектронныйРесурс = ЭлектронныйРесурс Тогда
						
						Если Строка.СкрыватьОтУченика И ЭтоУчащийся И НЕ ЭтоПреподаватель Тогда
							Продолжить;
						КонецЕсли;
						
						Если НЕ Документы.ПроведениеОбученияСУО.МожноПоказатьРесурсПроведения(
								ДанныеПроведенияОбучения.Статус,
								Строка.ПоказатьПриСтатусеЗапланировано,
					            Строка.ПоказатьПриСтатусеАктивно,
							    Строка.ПоказатьПриСтатусеЗавершено) Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						Если ЭтоУчащийся И Строка.ПоказатьПослеПрохождения Тогда
							Если ПрохождениеОбученияУчастника = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							СтатусПроцессаОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбученияУчастника);							
							Если СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						
						МожноПросматриватьЭлектронныйРесурс = Истина;
						
					КонецЕсли;
				
				КонецЦикла;
				
				Если НЕ МожноПросматриватьЭлектронныйРесурс Тогда
					Ошибка = "Error:" + НСтр("ru = 'Запрещено открывать данный электронный ресурс'");
					Возврат;					
				КонецЕсли;
								
			КонецЕсли;			
			
		КонецЕсли;		
		
		//----------------------------------//
		
		//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
				
		// Ошибка = "Error:" + НСтр("ru = 'Данный продукт не поддерживает работу с электронными ресурсами в контексте проведения обучения.'");
		// Возврат;

		//----------------------------------//
		
	Иначе
		
		// Электронный ресурс запущен вне контекста обучения, как самостоятельный объект
		
		Если ПроверятьПрава Тогда
		
			Права = ДанныеСессии.Права.Получить();
			
			МожноПросматриватьЭлектронныйРесурс = Ложь;
			
			Если Права.Свойство("ЭлектронныеРесурсы") И Права.ЭлектронныеРесурсы Тогда
				
				Если Константы.ОграничиватьДоступНаУровнеЗаписей.Получить() Тогда
				
					Если УправлениеДоступом.ЕстьРоль("ЭлектронныеРесурсыПросмотрКаталогаСУО", ЭлектронныйРесурс, Пользователь) Тогда //--# КК: ЗАМЕНИТЬ РОЛЬ НА "УченикКК"
						МожноПросматриватьЭлектронныйРесурс = Истина;
					КонецЕсли;
					
				Иначе
					
					МожноПросматриватьЭлектронныйРесурс = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
			
			Если Права.Свойство("Библиотека") И Права.Библиотека Тогда
				
				Если РегистрыСведений.БиблиотекаПользователейСУО.РесурсДоступенПользователю(Пользователь, ЭлектронныйРесурс) Тогда
					МожноПросматриватьЭлектронныйРесурс = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			//----------------------------------//
			
			Если НЕ МожноПросматриватьЭлектронныйРесурс Тогда
				Ошибка = "Error:" + НСтр("ru = 'Нарушение прав доступа'");
				Возврат;					
			КонецЕсли;			
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры
